function Saba7() {
  document.body.style.backgroundColor = "white";
  document.getElementById("p1").style.color = "black";
document.getElementById("p1").innerHTML=`
  <h1 id="Saba7">أذكار الصباح</h1>
  <p>
  آية الكرسي:
  <br>
  (اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).
<br>
من قالَها حين يُصبِح أُجير من الجن حتى يُمسي، ومن قالَها حين يُمسي أُجير من الجنِ حتى يُصبِح.
<hr>
سورة الإخلاص:
<br>
بسم الله الرحمن الرحيم

(قُلْ هُوَ اللَّهُ أَحَدٌ - اللَّهُ الصَّمَدُ - لَمْ يَلِدْ وَلَمْ يُولَدْ - وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ) - (ثلاث مرات).
<hr>
سورة الفلق:
<br>
بسم الله الرحمن الرحيم

(قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ - مِن شَرِّ مَا خَلَقَ- وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ - وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ - وَمِن شَرِّ

حَاسِد إِذَا حَسَد) - (ثلاث مرات).
<hr>
سورة الناس:
<br>
بسم الله الرحمن الرحيم

(قُلْ أَعُوذُ بِرَبِّ النَّاسِ - مَلِكِ النَّاسِ - إِلَٰهِ النَّاسِ - مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ - الَّذِي يُوَسْوِسُ فِي صُدُورِ

النَّاسِ - مِنَ الْجِنَّةِ وَالنَّاس) - (ثلاث مرات).
<br>
من قال الإخلاص والمعوذات حين يُصبِح، وحين يُمسي كفته من كل شيء.
<hr>
(أصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ

قدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذا اليوم وَخَيرَ ما بَعْدَه وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر).

(اللّهُمَّ بِكَ أَصْبَحْنا، وَبِكَ أَمْسَينا، وَبِكَ نَحْيا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النشورُ).
<hr>
(اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ).

(اللَّهُمَّ إنِّي أصبَحتُ أُشهِدُك وأُشهِدُ حَمَلةَ عَرشِكَ ومَلائِكَتَك وجميعَ خَلقِكَ، أنَّكَ أنتَ اللهُ لا إلهَ إلَّا أنتَ وأنَّ مُحمَّدًا

عبدُكَ ورسولُكَ).
<br>
من قالها أعتقه الله مِن النار.
<hr>
(اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ).
<br>
من قالها حين يُصبح أَدّى شُكرَ يَومِه.
<hr>
(اللَّهمَّ عافِني في بدَني اللَّهمَّ عافِني في سمعي اللَّهمَّ عافِني في بصري لا إلهَ إلَّا أنت، اللَّهمَّ إنِّي أعوذُ بِكَ منَ الكُفْرِ
والفقرِ اللَّهمَّ إنِّي أعوذُ بكَ من عذابِ القبرِ لا إلهَ إلَّا أنت)، (ثلاث مرات).
<hr>
(حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ، عَلَيهِ تَوَكَّلتُ، وَهُوَ رَبُّ العَرْشِ العَظيم)، (سبع مرات).
<br>
من قالها كفاهُ الله ما أَهَمّهُ مِن أَمرِ الدُنيا، والآخِرة.
<hr>
(اللهمَّ إني أسألُك العفوَ والعافيةَ، في الدنيا والآخرةِ، اللهمَّ إني أسألُك العفوَ والعافيةَ، في دِيني ودنيايَ وأهلي ومالي، اللهمَّ استُرْ عوراتي وآمِنْ روعاتي واحفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذُ بك أن أُغْتَالَ من تحتي).
<hr>
(اللَّهمَّ عالِمَ الغَيبِ والشَّهادةِ، فاطرَ السَّمواتِ والأرضِ، رَبَّ كلِّ شيءٍ ومَليكَهُ، أشهدُ أن لا إلَهَ إلَّا أنتَ، أعوذُ بِكَ مِن شرِّ نفسي وشرِّ الشَّيطانِ وشِركِهِ).
<hr>
(بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ)، (ثلاث مرات).
<br>
من قاله لم يضرهُ مِن اللهِ شيء.
<hr>
(رَضيتُ بِاللهِ رَبَّاً وَبِالإسْلامِ ديناً وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيّاً)، (ثلاث مرات).
<br>
من قالها حين يُصبِح وحين يُمسِي كان حَقاً على الله أَن يُرضيه يَوم القيامة.
<hr>
(يا حيُّ يا قيُّومُ، برَحمتِكَ أستَغيثُ، أصلِح لي شأني كُلَّهُ ولا تَكِلني إلى نَفسي طرفةَ عينٍ)
<hr>
(أَصبَحْنا على فِطرةِ الإسلامِ وعلى كَلِمةِ الإخلاصِ، وعلى دِينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ وعلى مِلَّةِ أبِينا

إبراهيمَ، حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ).
<hr>
(سُبْحانَ اللهِ وَبِحَمْدِهِ)، (مائة مرة).
<br>
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه وإن كانت مثل زبد البحر) متفق عليه.
<hr>
(لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له له الملكُ وله الحمدُ وهو على كلِّ شيءٍ قديرٌ)
<br>
من قالها في اليوم مائة مرة كانت لَهُ عَدل عَشر رِقاب، وكُتِبَت لهُ ماِئةُ حَسنة، ومُحِيَت عَنهُ مِائة سيئة، وكَانت لهُ حِرزاً مِن الشيطان.
<hr>
(سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ)، (ثلاث مرات).
<hr>
(اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلًا).
<hr>
(أَعوذُ بِكَلِماتِ اللّهِ التّامّاتِ مِنْ شَرِّ ما خَلَق).
<hr>
أسْتَغْفِرُ اللهَ العَظِيمَ وَأتُوبُ إلَيهِ)، (مائة مرة).
<hr>
(اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد)، (عشر مرات)</p>
  `;}
function Masa2() {
    document.body.style.backgroundColor = "black";
  document.getElementById("p1").style.color = "white";
document.getElementById("p1").innerHTML=`
<h1 id="Masa2">أذكار المساء</h1>
<p>
آية الكرسي:
<br>
(اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ).
<br>
من قالَها حين يُصبِح أُجير من الجن حتى يُمسي، ومن قالَها حين يُمسي أُجير من الجنِ حتى يُصبِح.
<hr>
سورة الإخلاص:
<br>
بسم الله الرحمن الرحيم

.(قُلْ هُوَ اللَّهُ أَحَدٌ - اللَّهُ الصَّمَدُ - لَمْ يَلِدْ وَلَمْ يُولَدْ - وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ).(ثلاث مرات)
<hr>
سورة الفلق:
<br>
بسم الله الرحمن الرحيم

(قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ - مِن شَرِّ مَا خَلَقَ - وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ - وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ - وَمِن شَرِّ

حَاسِد إِذَا حَسَد).(ثلاث مرات)
<hr>
سورة الناس:
<br>
بسم الله الرحمن الرحيم

(قُلْ أَعُوذُ بِرَبِّ النَّاسِ - مَلِكِ النَّاسِ - إِلَٰهِ النَّاسِ - مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ - الَّذِي يُوَسْوِسُ فِي صُدُورِ

النَّاسِ - مِنَ الْجِنَّةِ وَالنَّاس).(ثلاث مرات)
<br>
من قال الإخلاص والمعوذات حين يُصبِح، وحين يُمسي كفته من كل شيء.
<hr>
(أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد وهُوَ على كلّ شَيءٍ

قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر).
<hr>
(اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ).
<hr>
(اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ).
<hr>
(اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك وَمَلائِكَتِك وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ

لا شَريكَ لَـك وَأَنَّ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك)، (أربع مرات).
<hr>
(اللّهُـمَّ ما أَمسَى بِي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر).
<hr>
(اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ، اللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر وَالفَـقْر وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـت)، (ثلاث مرات).
<hr>
(حَسْبِـيَ اللهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظِـيم)، (سبع مرات).
<hr>
(اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي وَمِن فَوْقـي وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي).
<hr>
(اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ، فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم).
<hr>
(بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم)، (ثلاث مرات).
<hr>
(رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً)، (ثلاث مرات).
<hr>
(يَا حَيُّ يَا قيُّومُ بِرَحمَتِكَ أستَغِيثُ أصلِح لِي شَأنِي كُلَّهُ وَلاَ تَكِلُنِي إلَى نَفسِي طُرْفَةَ عَينٍ).
<hr>
(أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبُّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحُهَا وَنورَهُا وبرَكَتَهُا وَهُداهُا وَأَعُوذُ بِكَ

مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا).
<hr>
(أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ وَعَلَى كَلِمَةِ الإِخْلاَصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صلى الله عليه وسلم وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ).
<hr>
(سُبْحَانَ الله وَبِحَمْدِهِ)، (مائة مرة).
<hr>
(لا إِلَهَ إِلاَّ اللهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ)، (عشر مرات).
<hr>
(أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيهِ)، (مائة مرة).
<hr>
(أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق)، (ثلاث مرات).
<hr>
(اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ)، (عشر مرات).</p>
`;}